OdIfc.OdIfcEntity.subWorldDraw(OdGiWorldDraw*)
\details
Draws a graphical entity representation that is independent of any viewport context.
\param wd [in] A raw pointer to the object that encapsulates parameters of viewport-independent vectorization.
\returns true if the drawing was successful; otherwise, the method returns false.

OdIfc.OdIfcEntity.subSetAttributes(OdGiDrawableTraits*)
\details
Sets the values of the entity's sub-entity traits.
\param traits [out] A raw pointer to the traits to be filled and returned to a calling subroutine.
\returns The result of setting the values.

OdIfc.OdIfcEntity.gsNode
\details
Retrieves the current Gs node object of the entity.
\returns A raw pointer to the OdGsCache object associated with the entity.

OdIfc.OdIfcEntity.setGsNode(OdGsCache*)
\details
Sets a new Gs node cache for the entity.
\param pGsNode [in] A raw pointer to an OdGsCache object.

OdIfc.OdIfcEntity.unresolve
\details
Unresolves the entity.

OdIfc.OdIfcEntity.resolve(OdIfc.IfcOpResult,System.Void*)
\details
Resolves the entity and returns the result of the entity composition to a calling subroutine.
\param resolved [in]  A resolution operation result.
\param resPtr   [out] A raw pointer that references the entity composition result value.

OdIfc.OdIfcEntity.putAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new value of an attribute that is specified by its name.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\param val              [in] A new attribute value to be set.
\returns true if the attribute value was successfully set; otherwise, the method returns false.

OdIfc.OdIfcEntity.unsetAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Clears the attribute value.
\param explicitAttrName [in] An ANSI string that contains the attribute name.

OdIfc.OdIfcEntity.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns true if the attribute has a value; otherwise, the method returns false (the attribute value is not set).

OdIfc.OdIfcEntity.isKindOf(OdIfc.OdIfcEntityType)
\details
Retrieves whether the entity belongs to a specified entity type.
\param entityType [in] An entity type.
\returns true if the entity belongs to the specified type; otherwise, the method returns false.

OdIfc.OdIfcEntity.Dispose
\details
Destroys the entity object.
\remarks
All attached compound objects are deleted as well.

OdIfc.OdIfcEntity.#ctor
\details
Creates a new entity object with default parameters.

OdIfc.OdIfcEntity
\details
A class that represents an entity instance of an IFC file and provides IFC-specific functionality.